Hanson227/Intelligent-crutch/程序源码（stm32死机bug）/HARDWARE/timer/timer4.c
/**
  ******************************************************************************
  * @file    timer4.c
  * @author   chen
  * @version  V1.0
  * @date    2022-07-09
  * @brief   定时器4功能
  ******************************************************************************
  */
  
#include "stm32f4xx.h"

 /**
  * @brief  定时器4初始化，定时时间：arr*psc*1000/72000000  单位ms
  * @param  arr：自动重装值   0~65535
		  psc：时钟预分频数 0~65535
  * @retval 无
  */
void TIM4_Init(unsigned short int arr, unsigned short int psc)
{
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;            //定义一个设置定时器的变量
	NVIC_InitTypeDef NVIC_InitStructure;                          //定义一个设置中断的变量
	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);               //设置中断向量分组：第2组 抢先优先级：0 1 2 3 子优先级：0 1 2 3		
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4,ENABLE);           //使能TIM4时钟	
	TIM_DeInit(TIM4);                                             //定时器4寄存器恢复默认值	
    TIM_TimeBaseInitStructure.TIM_Period = arr; 	              //设置自动重装载值
	TIM_TimeBaseInitStructure.TIM_Prescaler=psc;                  //设置定时器预分频数
	TIM_TimeBaseInitStructure.TIM_CounterMode=TIM_CounterMode_Up; //向上计数模式
	TIM_TimeBaseInitStructure.TIM_ClockDivision=TIM_CKD_DIV1;     //1分频
	TIM_TimeBaseInit(TIM4,&TIM_TimeBaseInitStructure);            //设置TIM4
	
	TIM_ClearITPendingBit(TIM4,TIM_IT_Update);                    //清除溢出中断标志位
	TIM_ITConfig(TIM4,TIM_IT_Update,ENABLE);                      //使能TIM4溢出中断    
	TIM_Cmd(TIM4,DISABLE);                                        //先关闭TIM4                          
	
	NVIC_InitStructure.NVIC_IRQChannel=TIM4_IRQn;                 //设置TIM4中断
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority=0;       //抢占优先级0
	NVIC_InitStructure.NVIC_IRQChannelSubPriority=1;              //子优先级1
	NVIC_InitStructure.NVIC_IRQChannelCmd=ENABLE;                 //中断通道使能
	NVIC_Init(&NVIC_InitStructure);                               //设置中断
}

/*********************************************END OF FILE**********************/

